# EJERCICIO MÓDULO 4: BASE DE DATOS 'SUPERMERCADO'

## 1-CREACIÓN DE LA BASE DE DATOS.

Se genera una Base de Datos relacional cuya temática es la operativa habitual de un supermercado. Para ello, se definirán las correspondientes tablas de datos, así como las relaciones entre dichas tablas.

### 1.1-DEFINICIÓN DE LAS TABLAS DE DATOS.

Se define cada una de las tablas que componen la Base de Datos, junto a sus atributos, los tipos de datos y las relaciones.

#### 1.1.1-TABLA tiendas.

|Columna          |Tipo                       |Valores permitidos|
|-----------------|---------------------------|------------------|
|**id_tienda**    |INT UNSIGNED AUTO_INCREMENT|                  |
|**nombre_tienda**|VARCHAR(60)                |                  |
|**direccion**    |VARCHAR(80)                |                  |
|**ciudad**       |VARCHAR(40)                |                  |
|**cod_postal**   |INT(5) UNSIGNED            |                  |
|**PRIMARY KEY**  |(id_tienda)                |                  |

#### 1.1.2-TABLA empleados.

|Columna              |Tipo                                     |Valores permitidos                          |
|---------------------|-----------------------------------------|--------------------------------------------|
|**id_empleado**      |INT UNSIGNED AUTO_INCREMENT              |                                            |
|**id_tienda**        |INT UNSIGNED                             |                                            |
|**nombre_empleado**  |VARCHAR(30)                              |                                            |
|**apellido_empleado**|VARCHAR(30)                              |                                            |
|**puesto**           |ENUM                                     |'Cajero', 'Gerente', 'Reponedor', 'Vendedor'|
|**PRIMARY KEY**      |(id_empleado)                            |                                            |
|**FOREIGN KEY**      |(id_tienda) REFERENCES tienda (id_tienda)|                                            |

#### 1.1.3-TABLA categorias.

|Columna             |Tipo                       |Valores permitidos|
|--------------------|---------------------------|------------------|
|**id_categoria**    |INT UNSIGNED AUTO_INCREMENT|                  |
|**nombre_categoria**|VARCHAR(60)                |                  |
|**PRIMARY KEY**     |(id_categoria)             |                  |

#### 1.1.4-TABLA productos.

|Columna            |Tipo                                               |Valores permitidos|
|-------------------|---------------------------------------------------|------------------|
|**id_producto**    |INT UNSIGNED AUTO_INCREMENT                        |                  |
|**id_categoria**   |INT UNSIGNED                                       |                  |
|**nombre_producto**|VARCHAR(60)                                        |                  |
|**precio**         |FLOAT(10,2)                                        |                  |
|**stock**          |MEDIUMINT                                          |                  |
|**PRIMARY KEY**    |(id_producto)                                      |                  |
|**FOREIGN KEY**    |(id_categoria) REFERENCES categorias (id_categoria)|                  |

#### 1.1.5-TABLA clientes.

|Columna             |Tipo                                   |Valores permitidos|
|--------------------|---------------------------------------|------------------|
|**id_cliente**      |INT UNSIGNED PRIMARY KEY AUTO_INCREMENT|                  |
|**nombre_cliente**  |VARCHAR(60)                            |                  |
|**apellido_cliente**|VARCHAR(60)                            |                  |
|**email**           |VARCHAR(60)                            |                  |
|**cod_postal**      |INT(5) UNSIGNED                        |                  |
|**PRIMARY KEY**     |(id_cliente)                           |                  |

#### 1.1.6-TABLA ordenes.

|Columna        |Tipo                                            |Valores permitidos   |
|---------------|------------------------------------------------|---------------------|
|**id_orden**   |INT UNSIGNED AUTO_INCREMENT                     |                     |
|**id_cliente** |INT UNSIGNED                                    |                     |
|**id_empleado**|INT UNSIGNED                                    |                     |
|**fecha_orden**|DATE                                            |                     |
|**metodo_pago**|ENUM                                            |'Tarjeta', 'Efectivo'|
|**PRIMARY KEY**|(id_orden)                                      |                     |
|**FOREIGN KEY**|(id_cliente) REFERENCES clientes (id_cliente)   |                     |
|**FOREIGN KEY**|(id_empleado) REFERENCES empleados (id_empleado)|                     |

#### 1.1.7-TABLA detalle_ordenes.

|Columna             |Tipo                                            |Valores permitidos|
|--------------------|------------------------------------------------|------------------|
|**id_detalle_orden**|INT UNSIGNED AUTO_INCREMENT                     |                  |
|**id_orden**        |INT UNSIGNED                                    |                  |
|**id_producto**     |INT UNSIGNED                                    |                  |
|**cantidad**        |INT UNSIGNED                                    |                  |
|**precio_unitario** |FLOAT(10,2)                                     |                  |
|**descuento**       |FLOAT(3,2)                                      |                  |
|**PRIMARY KEY**     |(id_detalle_orden)                              |                  |
|**FOREIGN KEY**     |(id_orden) REFERENCES ordenes (id_orden)        |                  |
|**FOREIGN KEY**     |(id_producto) REFERENCES productos (id_producto)|                  |

### 1.2-CÓDIGO SQL DE LA BASE DE DATOS

Se añade a una variable ('query'), en formato string, el conjunto de sentencias SQL que generan la Base de Datos 'supermercado'. De esta manera, desde código Python integrado en este mismo notebook, se puede ir extrayendo de la variable cada sentencia SQL a ejecutar.

In [1]:
query = """/*Se borra cualquier Base de Datos existente que tenga el mismo nombre*/

DROP DATABASE IF EXISTS supermercado;

/*Se crea la Base de Datos*/

CREATE DATABASE IF NOT EXISTS supermercado;

USE supermercado;

/*Se crea la tabla tiendas*/

CREATE TABLE tiendas (
    id_tienda INT UNSIGNED AUTO_INCREMENT,
    nombre_tienda VARCHAR(60),
    direccion VARCHAR(80),
    ciudad VARCHAR(40),
    cod_postal VARCHAR(5),
    PRIMARY KEY (id_tienda)
);

/*Se crea la tabla empleados*/

CREATE TABLE empleados (
    id_empleado INT UNSIGNED AUTO_INCREMENT,
    id_tienda INT UNSIGNED,
    nombre_empleado VARCHAR(30),
    apellido_empleado VARCHAR(30),
    puesto ENUM ('Cajero', 'Gerente', 'Reponedor', 'Vendedor'),
    PRIMARY KEY (id_empleado),
    FOREIGN KEY (id_tienda) REFERENCES tiendas (id_tienda)
);

/*Se crea la tabla categorias*/

CREATE TABLE categorias (
    id_categoria INT UNSIGNED AUTO_INCREMENT,
    nombre_categoria VARCHAR(60),
    PRIMARY KEY (id_categoria)
);

/*Se crea la tabla productos*/

CREATE TABLE productos (
    id_producto INT UNSIGNED AUTO_INCREMENT,
    id_categoria INT UNSIGNED,
    nombre_producto VARCHAR(60),
    precio FLOAT(10,2),
    stock MEDIUMINT,
    PRIMARY KEY (id_producto),
    FOREIGN KEY (id_categoria) REFERENCES categorias (id_categoria)
);

/*Se crea la tabla clientes*/

CREATE TABLE clientes (
    id_cliente INT UNSIGNED AUTO_INCREMENT,
    nombre_cliente VARCHAR(30),
    apellido_cliente VARCHAR(30),
    email VARCHAR(80),
    direccion VARCHAR(80),
    ciudad VARCHAR(40),
    cod_postal VARCHAR(5),
    PRIMARY KEY (id_cliente)
);

/*Se crea la tabla ordenes*/

CREATE TABLE ordenes (
    id_orden INT UNSIGNED AUTO_INCREMENT,
    id_cliente INT UNSIGNED,
    id_empleado INT UNSIGNED,
    fecha_orden DATE,
    metodo_pago ENUM ('Tarjeta', 'Efectivo'),
    PRIMARY KEY (id_orden),
    FOREIGN KEY (id_cliente) REFERENCES clientes (id_cliente),
    FOREIGN KEY (id_empleado) REFERENCES empleados (id_empleado)
);

/*Se crea la tabla detalle_ordenes*/

CREATE TABLE detalle_ordenes (
    id_detalle INT UNSIGNED AUTO_INCREMENT,
    id_orden INT UNSIGNED,
    id_producto INT UNSIGNED,
    cantidad INT UNSIGNED,
    precio_unitario FLOAT(10,2),
    descuento FLOAT(3,2),
    PRIMARY KEY (id_detalle),
    FOREIGN KEY (id_orden) REFERENCES ordenes (id_orden),
    FOREIGN KEY (id_producto) REFERENCES productos (id_producto)
);
"""

### 1.3-CÓDIGO PYTHON PARA GENERAR LA BASE DE DATOS.

#### 1.3.1-DATOS DE CONEXIÓN A LA BASE DE DATOS.

In [2]:
usuario_db = 'root'
password_db = 'admin'
host_db = 'localhost'
port_db = '3306'
nombre_db = 'supermercado'

#### 1.3.2-INICIALIZACIÓN DE LIBRERÍAS.

In [3]:
import pandas as pd
import mysql.connector as con
from mysql.connector import Error # Se importa el módulo de errores de conexión a Base de Datos.
from sqlalchemy import create_engine, exc
import random
from datetime import datetime, timedelta

#### 1.3.3-CREACIÓN DE LA BASE DE DATOS.

In [4]:
try:
    conexion = con.connect(                     # Se crea la conexión.
    host= host_db,
    port = port_db,
    user = usuario_db,
    password = password_db
    )
    
    if conexion.is_connected():                 # Se comprueba si se ha establecido conexión correctamente con la Base de Datos.
        print("Conexión correcta a MySQL.")
        cursor = conexion.cursor()
        for sentencia in query.split(';'):      # Se crea una lista, cuyos elementos son las sentencias SQL contenidas en la variable 'query', se recorren sus elementos.
            if sentencia.strip():               # Elemento no vacío.
                cursor.execute(sentencia)       # Se ejecuta la sentencia.
        print("Base de datos y tablas creadas correctamente.")
        
except Error as e:                              # Se ha producido un error de conexión con la Base de Datos.
    print(f"Error al conectar con MySQL: {e}.")
    
finally:
    if conexion.is_connected():                 # Se cierran cursor y conexión.
        cursor.close()
        conexion.close()
        print("Conexión cerrada.")

Conexión correcta a MySQL.
Base de datos y tablas creadas correctamente.
Conexión cerrada.

## 2-GENERACIÓN DE DATOS DEMO.

### 2.1-FUNCIONES AUXILIARES.

#### 2.1.1-Función generar_direccion().

In [5]:
# Función que genera, de forma aleatoria una dirección.
    # Entrada: (vacía).
    # Salida: Devuielve una lista cuyos elementos son, respectivamente: calle, ciudad y código postal.
def generar_direccion():
    lista_direccion = []        # Se genera lista para almacenar datos de la dirección.
    
    # Lista que sirve de base para seleccionar la calle del cliente.
    direccion = [
        "Calle Serrano", "Avenida del Cid", "Plaza Mayor", "Calle Gran Vía", "Avenida de Burgos",
        "Calle de Alcalá", "Avenida Europa", "Calle San Martín", "Plaza del Sol", "Calle Princesa",
        "Avenida de la Ilustración", "Calle del Comercio", "Calle Real", "Calle Mayor", "Calle del Juego",
        "Avenida de España", "Calle Libertad", "Plaza Nueva", "Calle del Centro", "Calle Industria"
        ]
    
    # Lista que sirve de base para seleccionar la ciudad del cliente.
    ciudad = [
        "Madrid", "Valencia", "Barcelona", "Sevilla", "Bilbao",
        "Málaga", "Granada", "Santander", "Alicante", "Zaragoza",
        "Córdoba", "Valladolid", "Oviedo", "Murcia", "Toledo",
        "Salamanca", "San Sebastián", "Palma", "Burgos", "Almería"
        ]
    
    # Lista que sirve de base para seleccionar el código postal del cliente.
    cod_postal = [
        28001, 46001, 8002, 41004, 48002,
        29007, 18001, 39001, 30001, 50001,
        14001, 47001, 33001, 30002, 45001,
        37001, 20001, 7011, 9001, 40001
        ]

    indice = random.randint(0, len(direccion) - 1)      # Se genera, aleatoriamente, el índice para seleccionar los correspondientes datos en cada una de las listas.
    lista_direccion = [direccion[indice] + f', {random.randint(1, 100)}', ciudad[indice], str(cod_postal[indice]).zfill(5)]         # Se añaden los datos seleccionados a la lista.
    return lista_direccion

#### 2.1.2-Función generar_nombre_apellido().

In [6]:
# Función para generar una lista cuyos elementos son un nombre y un apellido, de forma aleatoria.
# Entrada: (vacía).
# Salida: Una lista cuyo primer elemento es un nombre, y su segundo elemento es un apellido.
def generar_nombre_apellido():
    
        # Lista que sirve de base para seleccionar el nombre.
        nombres_personas = [
            "Antonio", "María", "José", "Carmen", "Manuel", "Ana", "Francisco", "Laura",
            "Juan", "Isabel", "David", "Marta", "Luis", "Sara", "Javier", "Lucía",
            "Carlos", "Paula", "Miguel", "Elena", "Rafael", "Sofía", "Pedro", "Clara",
            "Jorge", "Teresa", "Alberto", "Rosa", "Álvaro", "Beatriz", "Sergio", "Julia",
            "Raúl", "Natalia", "Fernando", "Lorena", "Pablo", "Eva", "Diego", "Patricia",
            "Andrés", "Gloria", "Héctor", "Alicia", "Guillermo", "Cristina", "Rubén", "Verónica",
            "Vicente", "Noelia", "Óscar", "Silvia", "Adrián", "Nuria", "Ricardo", "Esther",
            "Ramón", "Irene", "Roberto", "Andrea"
            ]
        
        # Lista que sirve de base para seleccionar el apellido.
        apellidos_personas = [
            "García", "Martínez", "López", "Sánchez", "González", "Pérez", "Rodríguez", "Fernández",
            "Gómez", "Ruiz", "Díaz", "Hernández", "Alonso", "Torres", "Gil", "Ramírez",
            "Moreno", "Jiménez", "Molina", "Castro", "Ortiz", "Rubio", "Vázquez", "Romero",
            "Serrano", "Navarro", "Ramos", "Domínguez", "Álvarez", "Gutiérrez", "Iglesias", "Suárez",
            "Cruz", "Castillo", "Flores", "Delgado", "Nieto", "Aguilar", "Vega", "Herrera",
            "Peña", "Cabrera", "Fuentes", "León", "Marín", "Soto", "Rojas", "Carmona",
            "Guerrero", "Pardo", "Méndez", "Blanco", "Campos", "Vidal", "Luna", "Calvo",
            "Reyes", "Moya", "Ortega", "Prieto"
            ]
        
        nombre = random.choice(nombres_personas)        # Se selecciona, aleatoriamente, un nombre.
        apellido = random.choice(apellidos_personas)    # Se selecciona, aleatoriamente, un apellido.
            
        return [nombre, apellido]

#### 2.1.3-Función generar_fechas().

In [7]:
# Función para generar, de forma aleatoria, una fecha entre dos fechas datas.
# Entrada: Fecha de Inicio, formato AAAA-MM-DD en string & Fecha de Fin, formato AAAA-MM-DD en string.
# Salida: String con la fecha en formato AAAA-MM-DD. En caso de formato de fecha fin < fecha inicio, o quetengan un formato inadecuado, se genera un error y se imprime un mensaje de error.
def generar_fecha_aleatoria(fecha_inicio_str, fecha_fin_str):
    try:
        # Se comprueban y convierten las fechas de string a objetos datetime.
        fecha_inicio = datetime.strptime(fecha_inicio_str, '%Y-%m-%d')
        fecha_fin = datetime.strptime(fecha_fin_str, '%Y-%m-%d')
        
        # Se valida que la fecha de inicio es anterior o igual a la fecha fin.
        if fecha_inicio > fecha_fin:
            raise ValueError("La fecha de inicio no puede ser posterior a la fecha fin.")
        
        dias_totales = (fecha_fin - fecha_inicio).days                      # Se calcula el número total de días entre las dos fechas.
        
        dias_aleatorios = random.randint(0, dias_totales)                   # Se genera un número aleatorio de días dentro del rango.
        
        fecha_aleatoria = fecha_inicio + timedelta(days=dias_aleatorios)    # Se genera la nueva fecha aleatoria.
        
        return fecha_aleatoria.strftime('%Y-%m-%d')                         # Se devuelve la fecha aleatoria en formato string.
        
    except ValueError as e:                                                 # Se gestionan los de errores, si el formato es incorrecto o hay algún problema.
    
        return f"Error: {e}"

#### 2.1.4-Función insertar_dataframe().

In [8]:
# Función para insertar un DataFrame en una base de datos.
# Entrada: pd.DataFrame, con los datos a insertar & String, con el nombre de la base de datos & String, con el nombre de la tabla donde se insertará.
# Salida:  Si hasucedido algún error, se imprime mensaje de error.
def insertar_dataframe(df, database_name, table_name):
    try:
        connection = con.connect(                                           # Se crea la conexión.
            host = "localhost",
            port = "3306",
            user = "root",
            password = "admin",
            database = database_name
        )
        cursor = connection.cursor()                                        # Se crea el cursorde la conexión.
        
        columns = ','.join(df.columns)                                      # Se genera el string con las columnas del DataFrame.
        placeholders = ','.join(['%s'] * len(df.columns))                   # Se generan tantos 'placeholders' como columnas tiene el DataFrame.
        sql = f'INSERT INTO {table_name} ({columns}) VALUES ({placeholders});'  # Se monta la sentencia SQL a insertar con las columnas y los 'placeholders' generados anteriormente.
    
        filas = [tuple(fila) for index, fila in df.iterrows()]     # Se genera una lista de tuplas con los datos del DataFrame.

        cursor.executemany(sql, filas)                             # Se ejecuta la lista con las tuplas de las filas del DataFrame.
        
        connection.commit()
        return cursor.rowcount                  # Se devuelve el número de filas insertadas.
    except con.Error as error:                  # Se gestionan los posibles errores que puedan surgir. 
        print(f"Ha ocurrido un error: {error}")
        if connection:
            connection.rollback()
        return 0
    finally:                                    # Al finalizar las insercciones en la Base de Datos, Se cierran el cursor y la conexión.
        if cursor: 
            cursor.close()
        if connection:
            connection.close()

#### 2.1.5-Función consultar_bd().

In [9]:
def consultar_bd(query, usuario_db, password_db, host_db, nombre_db):

    # Se crea la URL de la conexión.
    url_db = f'mysql+pymysql://{usuario_db}:{password_db}@{host_db}/{nombre_db}'

    try:
        engine = create_engine(url_db)                  # Se crea el motor de conexión.

        with engine.connect() as connection:            # Conexión con contexto administrado para garantizar el cierre.
            df = pd.read_sql(query, con=connection)     # Se ejecuta la consulta y se cargan los resultados en un DataFrame.
            return df

    except exc.OperationalError as e:
        print("Error de conexión a la base de datos. Verificar los parámetros de conexión.")
        print(e)

    except exc.ProgrammingError as e:
        print("Error en la consulta SQL. Revisar la sintaxis de la consulta.")
        print(e)

    except Exception as e:
        print("Ocurrió un error inesperado:")
        print(e)

    finally:                                            # Se libera el motor creado.
        if 'engine' in locals() and not engine.dispose():
            engine.dispose()

#### 2.1.6-Función generar_tiendas().

In [10]:
# Función para generar un DataFrame con un número aleatorio (entre 5 y 10) de tiendas.
# Entrada: (vacía).
# Salida: pd.DataFrame con datos de ejemplo de la tabla 'tienda'.
def generar_tiendas():
    
    num_tiendas = random.randint(5, 10)             # Se genera el número de tiendas que se van a crear, entre 5 y 10 tiendas.
    
    lista_tiendas = []                              # Se genera una lista donde se almacenarán los datos de las tiendas.
    
    for id_tienda in range(1, num_tiendas+1):       # Se crean las tiendas, según el número generado aleatoriamente.
        datos_direccion = generar_direccion()       # Se genera la dirección de la tienda.
        lista_tiendas.append({                      # Se añaden, a la lista, los datos de cada tienda generada.
            'id_tienda': id_tienda,
            'nombre_tienda': 'Supermercado ' + str(id_tienda),
            'direccion': datos_direccion[0],
            'ciudad': datos_direccion[1],
            'cod_postal': datos_direccion[2],
        })
    df = pd.DataFrame(lista_tiendas)                # Se crea el DataFrame a devolver.

    return df

#### 2.1.7-Función generar_empleados().

In [11]:
# Función para generar un Dataframe de Pandas con datos de ejemplo de empleados, de forma aleatoria, para cada tienda generada. Se generarán 20 empleados por tienda. 
# Un mismo empleado no puede pertenecer a más de una tienda al mismo tiempo.
# El valor del campo 'id_empleado' serán valores enteros cosecutivos, comenzando por '1'. Este campo, además, será el índice del DataFrame)
# El valor del campo 'puesto' debe ser un valor, a elegir de forma aleatoria entre los siguientes valores posibles: (‘Cajero’, ‘Gerente’, ‘Reponedor’, ‘Vendedor’).
# Entrada: Numero entero, mayor o igual a 1, de empleados a generar por tienda & lista con las id's de las tiendas generadas previamente. 
# Salida: pd.DataFrame con datos de ejemplo de la tabla 'empleados'.
def generar_empleados(num_empleados, lista_id_tiendas):
    
    lista_puestos = ['Cajero', 'Gerente', 'Reponedor', 'Vendedor']      # Lista con los puestos definidos en el supermercado.
    
    lista_empleados = []        # Se genera una lista para almacenar los datos de empleados.
    id_empleado = 1             # Se inicializa el id del empleado.

    for id_tienda in lista_id_tiendas:                          # Se recorren los id's de las tiendas existentes.
        for _ in range(num_empleados):                          # Se itera entre el número de empleados total que debe tener cada tienda.
            nombre_empleado = generar_nombre_apellido()[0]      # Se genera el nombre del empleado.
            apellido_empleado = generar_nombre_apellido()[1]    # Se genera el apellido del empleado. 
            puesto = random.choice(lista_puestos)               # Se selecciona el puesto del empleado.
            lista_empleados.append({                            # Se añade el diccionario con los datos de cada empleado a la lista.
                'id_empleado': id_empleado,
                'id_tienda': id_tienda,
                'nombre_empleado': nombre_empleado,
                'apellido_empleado': apellido_empleado,
                'puesto': puesto
            })
            id_empleado += 1

    df_empleados = pd.DataFrame(lista_empleados)        # Se crea el DataFrame a partir de la lista de empleados.
    
    return df_empleados

#### 2.1.8-Función generar_categorias().

In [12]:
# Función para generar un DataFrame de Pandas con 10 categorías de productos en venta.
# Entrada: (vacía). 
# Salida: pd.DataFrame con datos de ejemplo de la tabla 'categorias'. El campo 'id_categoria' es el índice del DataFrame
def generar_categorias():
    
    num_categorias = 10         # Se fija el número de categorías en 10.
    lista_categorias = {
        'id_categoria': [i + 1 for i in range(num_categorias)],     # Se genera una lista con los id_categoria.
        'nombre_categoria': ['Lácteos', 'Carnes', 'Frutas', 'Verduras', 'Bebidas', 'Panadería', 'Higiene', 'Pescadería', 'Charcutería', 'Parafarmacia']     # Revisar en caso de que num_categorias > 10
        }
    df = pd.DataFrame(lista_categorias)

    return df

#### 2.1.9-Función generar_productos().

In [13]:
# Función que genera un DataFrame de Pandas con datos de ejemplo de productos por cada categoría existente en la tabla 'categorias'.
# Entrada: pd.DataFrame de categorias & numero entero >=1.
# Salida: pd.DataFrame con datos de productos de ejemplo por cada categoría existente en la tabla 'categorias'
def generar_productos(n_productos,df_categorias):
    
    datos_productos = []                                    # Se genera una lista para almacenar los datos de los productos.

    id_producto = 1                                         # Contador para el id_productos.
    
    for id_cat in df_categorias['id_categoria']:            # Se recorrer los id_categorias.
        for n_prod in range(n_productos):                   # Se itera el numéro deseado de productos por cada categoría.
            nombre_producto = (f'Producto_{df_categorias['nombre_categoria'][id_cat-1]}_{n_prod+1}')        # Se forma el nombre de producto: Prducto_Categoría_Numero.
            precio = round(random.uniform(1.0, 100.0), 2)   # Se genera un precio aleatorio entre 1.00 y 100.00.
            stock = random.randint(10, 200)                 # Se genera un stock aleatorio entre 10 y 200 unidades.
            datos_productos.append({                        # Se añaden los datos de cada producto a la lista.
                'id_producto': id_producto,
                'id_categoria': id_cat,
                'nombre_producto': nombre_producto,
                'precio': precio,
                'stock': stock
            })
            id_producto += 1

    df_productos = pd.DataFrame(datos_productos)            # Se crea el DataFrame.

    return df_productos

#### 2.1.10-Función generar_clientes().

In [14]:
# Función para generar un Dataframe de Pandas con datos de ejemplo de clientes, de forma aleatoria.
# Entrada: Numero entero, mayor o igual a 1, de clientes a generar por tienda.
# Salida: pd.DataFrame con datos de ejemplo de la tabla 'clientes'. 
def generar_clientes(num_clientes):
    
    lista_datos_clientes = []           # Se genera lista para almacenar datos de los clientes.
          
    for num_c in range(num_clientes):                      # Se genera el numero de clientes definido en la entrada.
        nombre_cliente = generar_nombre_apellido()[0]      # Se selecciona, aleatoriamente, un nombre de cliente.
        apellido_cliente = generar_nombre_apellido()[1]    # Se selecciona, aleatoriamente, un apellido de cliente.
        lista_direccion = generar_direccion()              # Se genera, aleatoriamente, una dirección.
        
        lista_datos_clientes.append ({                     # Se añaden, a una lista, los datos generados del cliente.
            'id_cliente': num_c + 1,
            'nombre_cliente': nombre_cliente,
            'apellido_cliente': apellido_cliente,
            'email': nombre_cliente.lower() + '.' + apellido_cliente.lower() + str(num_c + 1) + '@test.com',
            'direccion': lista_direccion[0],
            'ciudad': lista_direccion[1],
            'cod_postal': lista_direccion[2],
            })

    df_clientes = pd.DataFrame(lista_datos_clientes)        # Se genera el DataFrame a devolver.
     
    return df_clientes

#### 2.1.11-Función generar_ordenes().

In [15]:
# Función para generar un múmero determinado de órdenes de compra demo, para la tabla 'ordenes'.
# Entrada: Número entero >=1 & Lista de códigos de cliente & Lista de códigos de empleados.
# Salida: pd.DataFrame con las ordenes generadas.
def generar_ordenes (num_ordenes, ids_clientes, ids_empleados):
    lista_ordenes = []
    lista_metodos_pago = ['Tarjeta', 'Efectivo']                # Lista para seleccionar los métodos de pago posibles.
    for id_orden in range(1,num_ordenes+1):                     # Se genera el número de ordenes concretados.
        lista_ordenes.append({                                  # Se añade las características de la orden a la lista.
            'id_orden': id_orden,
            'id_cliente': random.choice(ids_clientes),          # Se selecciona aleatoriamente in id_cliente.
            'id_empleado': random.choice(ids_empleados),        # Se selecciona aleatoriamente in id_empleado.
            'fecha_orden': generar_fecha_aleatoria('2024-01-01', '2025-01-31'), # Se genera aleatoriamente una fecha.
            'metodo_pago': random.choice(lista_metodos_pago)    # Se selecciona aleatoriamente unmétodo de pago.
        })
    df = pd.DataFrame(lista_ordenes)        # Se genera el DataFrame
    
    return df

#### 2.1.12-Función generar_detalle_ordenes().

In [16]:
# Función para generar un número determinado de demos de detalles de órdenes de compra, para la tabla 'detalle_ordenes'.
def generar_detalle_ordenes (num_detalles, ids_orden, df_productos):
    descuentos = (0.0, 0.05, 0.1, 0.15, 0.2, 0.25, 0.3, 0.35, 0.5) # Tupla con los descuentos permitidos.
    lista_detalles = []

    for id_detalle in range(1,num_detalles+1):                      # Se genera cada detallede orden.
        id_producto = random.choice(df_productos['id_producto'])    # Se selecciona aleatoriamente un id_producto.
        lista_detalles.append({                                     # Se añade las características de los detalles de la orden a la lista.
            'id_detalle': id_detalle, 
            'id_orden': random.choice(ids_orden),                   # Se elige aleatoriamente un id_orden.
            'id_producto': id_producto,
            'cantidad': random.randint(1, 20),                      # Se elige aleatoriamente una cantidad de unidades de compra del producto.
            'precio_unitario': df_productos[df_productos['id_producto'] == id_producto]['precio'].values[0],        # Se asigna el precio del producto anterior seleccionado.
            'descuento': random.choice(descuentos)                  # Se elige aleatoriamente un descuento a aplicar.
        })
    df = pd.DataFrame(lista_detalles)       # Se genera el DataFrame.
    
    return df

### 2.2-GENERACIÓN DE DATAFRAMES.

#### 2.2.1-DataFrame 'tiendas'.

In [17]:
df_tiendas = generar_tiendas()
df_tiendas

,id_tienda,nombre_tienda,direccion,ciudad,cod_postal
0,1,Supermercado 1,"Calle del Juego, 24",Toledo,45001
1,2,Supermercado 2,"Calle San Martín, 10",Santander,39001
2,3,Supermercado 3,"Calle del Juego, 41",Toledo,45001
3,4,Supermercado 4,"Calle Industria, 46",Almería,40001
4,5,Supermercado 5,"Calle del Comercio, 75",Valladolid,47001
5,6,Supermercado 6,"Calle del Juego, 59",Toledo,45001
6,7,Supermercado 7,"Calle Industria, 43",Almería,40001
7,8,Supermercado 8,"Calle Libertad, 84",San Sebastián,20001
8,9,Supermercado 9,"Calle Industria, 49",Almería,40001
9,10,Supermercado 10,"Calle Mayor, 44",Murcia,30002

#### 2.2.2-DataFrame 'empleados'.

In [18]:
df_empleados = generar_empleados(20, df_tiendas['id_tienda'])
df_empleados

     id_empleado  id_tienda nombre_empleado apellido_empleado     puesto
0              1          1          Andrea             Pardo    Gerente
1              2          1         Vicente           Vázquez   Vendedor
2              3          1        Cristina            Castro    Gerente
3              4          1            Rosa           Serrano     Cajero
4              5          1            José             Pérez   Vendedor
..           ...        ...             ...               ...        ...
195          196         10          Miguel           Vázquez     Cajero
196          197         10           Paula         Fernández  Reponedor
197          198         10            Luis           Álvarez    Gerente
198          199         10          Lorena              Díaz     Cajero
199          200         10           David           Álvarez  Reponedor

[200 rows x 5 columns]

#### 2.2.3-DataFrame 'categorias'.

In [19]:
df_categorias = generar_categorias()
df_categorias

   id_categoria nombre_categoria
0             1          Lácteos
1             2           Carnes
2             3           Frutas
3             4         Verduras
4             5          Bebidas
5             6        Panadería
6             7          Higiene
7             8       Pescadería
8             9      Charcutería
9            10     Parafarmacia

#### 2.2.4-DataFrame 'productos'.

In [20]:
df_productos = generar_productos(4, df_categorias)
df_productos

    id_producto  id_categoria          nombre_producto  precio  stock
0             1             1       Producto_Lácteos_1   66.48     32
1             2             1       Producto_Lácteos_2   70.80     42
2             3             1       Producto_Lácteos_3   40.12    189
3             4             1       Producto_Lácteos_4   33.01     98
4             5             2        Producto_Carnes_1   64.52     17
5             6             2        Producto_Carnes_2   76.53    195
6             7             2        Producto_Carnes_3   51.20    104
7             8             2        Producto_Carnes_4   89.34    167
8             9             3        Producto_Frutas_1   64.44     39
9            10             3        Producto_Frutas_2   82.51     56
10           11             3        Producto_Frutas_3   91.31     52
11           12             3        Producto_Frutas_4   60.99    154
12           13             4      Producto_Verduras_1   81.08    196
13           14             4      Producto_Verduras_2   14.31    165
14           15             4      Producto_Verduras_3    2.37     35
15           16             4      Producto_Verduras_4   76.42    118
16           17             5       Producto_Bebidas_1    2.15     34
17           18             5       Producto_Bebidas_2   91.26    128
18           19             5       Producto_Bebidas_3   49.56     44
19           20             5       Producto_Bebidas_4   81.27     29
20           21             6     Producto_Panadería_1   48.04    147
21           22             6     Producto_Panadería_2   12.98    177
22           23             6     Producto_Panadería_3   58.82    158
23           24             6     Producto_Panadería_4   59.99     43
24           25             7       Producto_Higiene_1   90.97     61
25           26             7       Producto_Higiene_2    2.34    183
26           27             7       Producto_Higiene_3   41.36     54
27           28             7       Producto_Higiene_4   22.58     20
28           29             8    Producto_Pescadería_1   90.72    168
29           30             8    Producto_Pescadería_2   45.01     64
30           31             8    Producto_Pescadería_3   81.74     94
31           32             8    Producto_Pescadería_4    6.41     63
32           33             9   Producto_Charcutería_1   59.86    162
33           34             9   Producto_Charcutería_2    6.96    170
34           35             9   Producto_Charcutería_3   50.20     73
35           36             9   Producto_Charcutería_4   63.29     17
36           37            10  Producto_Parafarmacia_1   55.53     54
37           38            10  Producto_Parafarmacia_2   76.67    168
38           39            10  Producto_Parafarmacia_3   66.65     68
39           40            10  Producto_Parafarmacia_4   75.57    140

#### 2.2.4-DataFrame 'clientes'.

In [21]:
df_clientes = generar_clientes(2000)
df_clientes

,id_cliente,nombre_cliente,apellido_cliente,email,direccion,ciudad,cod_postal
0,1,Pedro,Rubio,pedro.rubio1@test.com,"Avenida de la Ilustración, 98",Córdoba,14001
1,2,Rubén,Reyes,rubén.reyes2@test.com,"Plaza Nueva, 49",Palma,07011
2,3,Beatriz,Fernández,beatriz.fernández3@test.com,"Calle del Centro, 4",Burgos,09001
3,4,Lucía,Gómez,lucía.gómez4@test.com,"Calle Libertad, 5",San Sebastián,20001
4,5,Julia,Torres,julia.torres5@test.com,"Calle San Martín, 33",Santander,39001
...,...,...,...,...,...,...,...
1995,1996,Francisco,Ruiz,francisco.ruiz1996@test.com,"Avenida de la Ilustración, 99",Córdoba,14001
1996,1997,Ricardo,Herrera,ricardo.herrera1997@test.com,"Calle del Juego, 45",Toledo,45001
1997,1998,Manuel,Moreno,manuel.moreno1998@test.com,"Calle Serrano, 99",Madrid,28001
1998,1999,Rafael,Iglesias,rafael.iglesias1999@test.com,"Calle Libertad, 59",San Sebastián,20001
1999,2000,Andrés,Campos,andrés.campos2000@test.com,"Calle Princesa, 33",Zaragoza,50001

#### 2.2.5-DataFrame 'ordenes'.

In [22]:
df_ordenes = generar_ordenes(10000,df_clientes['id_cliente'], df_empleados['id_empleado'])
df_ordenes

      id_orden  id_cliente  id_empleado fecha_orden metodo_pago
0            1          65           53  2024-06-05     Tarjeta
1            2         945          145  2024-08-10    Efectivo
2            3         469           35  2024-08-27    Efectivo
3            4         441          129  2024-10-05    Efectivo
4            5         995          163  2024-11-05     Tarjeta
...        ...         ...          ...         ...         ...
9995      9996        1022           14  2024-08-14    Efectivo
9996      9997         551           91  2024-04-03     Tarjeta
9997      9998          88          174  2025-01-07    Efectivo
9998      9999        1158           44  2024-12-11    Efectivo
9999     10000         377          100  2024-12-05    Efectivo

[10000 rows x 5 columns]

#### 2.2.6-DataFrame 'detalles_ordenes'.

In [23]:
df_detalle_ordenes = generar_detalle_ordenes(30000,df_ordenes['id_orden'],df_productos)
df_detalle_ordenes

       id_detalle  id_orden  id_producto  cantidad  precio_unitario  descuento
0               1      9088           28         6            22.58       0.15
1               2      9734           11        13            91.31       0.35
2               3      6642           31         1            81.74       0.50
3               4       104           25        14            90.97       0.35
4               5      1706            5        15            64.52       0.50
...           ...       ...          ...       ...              ...        ...
29995       29996      2755            4         3            33.01       0.10
29996       29997      6040           34         4             6.96       0.10
29997       29998      2286           33        11            59.86       0.10
29998       29999      7400           12        15            60.99       0.15
29999       30000      7434           27        20            41.36       0.05

[30000 rows x 6 columns]

### 2.3-CARGA EN BASE DE DATOS.

In [24]:
# Variable con el nombre de la Base de Datos creada.
base_datos = 'supermercado'

#### 2.3.1-Carga de tabla 'tiendas'.

In [25]:
insertar_dataframe(df_tiendas,base_datos,'tiendas')

10

#### 2.3.2-Carga de tabla 'empleados'.

In [26]:
insertar_dataframe(df_empleados,base_datos,'empleados')

200

#### 2.3.3-Carga de tabla 'categorias'.

In [27]:
insertar_dataframe(df_categorias,base_datos,'categorias')

10

#### 2.3.4-Carga de tabla 'productos'.

In [28]:
insertar_dataframe(df_productos,base_datos,'productos')

40

#### 2.3.5-Carga de tabla 'clientes'.

In [29]:
insertar_dataframe(df_clientes,base_datos,'clientes')

2000

#### 2.3.6-Carga de tabla 'ordenes'.

In [30]:
insertar_dataframe(df_ordenes,base_datos,'ordenes')

10000

#### 2.3.7-Carga de tabla 'detalle_ordenes'.

In [31]:
insertar_dataframe(df_detalle_ordenes,base_datos,'detalle_ordenes')

30000

## 3-CONSULTAS SQL.

### 3.1-LISTADO DE ÓRDENES, CON DETALLES DE CLIENTE Y EMPLEADO.

* Mostrar el ID de la orden, la fecha, el nombre del cliente, el nombre del empleado que atendió la compra y el método de pago.
* Utilizar un JOIN entre las tablas ordenes, clientes y empleados.

In [32]:
query = """SELECT
                t1.id_orden AS 'Num de Orden',
                t1.fecha_orden AS Fecha,
                CONCAT(t2.nombre_cliente,' ',t2.apellido_cliente) AS Cliente,
                CONCAT(t3.nombre_empleado,' ',t3.apellido_empleado) AS Empleado,
                t1.metodo_pago AS 'Forma de Pago'
            FROM
                ordenes t1
            JOIN
                clientes t2
            ON
                t1.id_cliente = t2.id_cliente
            JOIN
                empleados t3
            ON
                t1.id_empleado = t3.id_empleado
        """

df_consulta_1 = consultar_bd(query, usuario_db, password_db, host_db, nombre_db)

df_consulta_1

,Num de Orden,Fecha,Cliente,Empleado,Forma de Pago
0,1,2024-06-05,Carlos Aguilar,Laura Rubio,Tarjeta
1,2,2024-08-10,Julia Díaz,Sara Molina,Efectivo
2,3,2024-08-27,Roberto Torres,Miguel Blanco,Efectivo
3,4,2024-10-05,Patricia Pardo,Alberto Ortiz,Efectivo
4,5,2024-11-05,Héctor Cruz,Carmen Reyes,Tarjeta
...,...,...,...,...,...
9995,9996,2024-08-14,Nuria Pardo,Ramón Fuentes,Efectivo
9996,9997,2024-04-03,Natalia González,Antonio Calvo,Tarjeta
9997,9998,2025-01-07,Eva Torres,Carlos León,Efectivo
9998,9999,2024-12-11,Ramón Hernández,Fernando Martínez,Efectivo
9999,10000,2024-12-05,Miguel Torres,Pedro Sánchez,Efectivo

### 3.2-LISTADO DE PRODUCTOS CON STOCK BAJO.

* Filtrar aquellos productos cuyo stock sea menor a 20.
* Mostrar el nombre del producto, categoría y stock.

In [33]:
query = """SELECT
                pro.nombre_producto AS Producto,
                cat.nombre_categoria AS Categoria,
                pro.stock AS Stock
            FROM
                productos pro
            JOIN
                categorias cat
            ON
                pro.id_categoria = cat.id_categoria
            WHERE
                pro.stock < 20
        """

df_consulta_2 = consultar_bd(query, usuario_db, password_db, host_db, nombre_db)

df_consulta_2

                 Producto    Categoria  Stock
0       Producto_Carnes_1       Carnes     17
1  Producto_Charcutería_4  Charcutería     17

### 3.3-LISTADO DE VENTAS TOTALES POR CATEGORÍA.

* Mostrar el nombre de la categoría y la suma total de las ventas (ej.: multiplicando cantidad * precio_unitario) para cada categoría.
* Realizar el JOIN con detalle_ordenes.
* Utilizar agrupación (GROUP BY).

In [34]:
query = """SELECT
                cat.nombre_categoria AS Categoria,
                SUM(det.cantidad * (det.precio_unitario * (1 - det.descuento))) AS Total_Ventas
            FROM
                categorias cat
            JOIN
                productos pro
            ON
                cat.id_categoria = pro.id_categoria
            JOIN
                detalle_ordenes det
            ON
                pro.id_producto = det.id_producto
            GROUP BY
                cat.id_categoria,
                cat.nombre_categoria
            ORDER BY
                Total_Ventas DESC
        """

df_consulta_3 = consultar_bd(query, usuario_db, password_db, host_db, nombre_db)

df_consulta_3

      Categoria  Total_Ventas
0        Frutas    1861438.22
1        Carnes    1743611.27
2  Parafarmacia    1659484.21
3       Bebidas    1435786.88
4    Pescadería    1357147.64
5       Lácteos    1291934.82
6   Charcutería    1115188.96
7     Panadería    1108878.23
8      Verduras    1043984.56
9       Higiene    1003142.73

### 3.4-LISTADO DE LOS CLIENTES CON MAYORES GASTOS ACUMULADOS.

* Mostrar el nombre del cliente y el monto total que ha gastado (suma de todas sus órdenes).
* Nos aseguramos de tener en cuenta posibles descuentos (descuento), si se ha definido. Por ejemplo, la fórmula podría ser (cantidad * precio_unitario) - descuento.
* Ordenar el resultado de mayor a menor gasto acumulado.

In [35]:
query = """SELECT
                CONCAT(cli.nombre_cliente, ' ',cli.apellido_cliente) AS Cliente,
                SUM(det.cantidad * (det.precio_unitario * (1 - det.descuento))) AS 'Total_Compras'
            FROM
                clientes cli
            JOIN
                ordenes ord
            ON
                cli.id_cliente = ord.id_cliente
            JOIN
                detalle_ordenes det
            ON
                ord.id_orden = det.id_orden
            GROUP BY
                cli.id_cliente,
                cli.nombre_cliente,
                cli.apellido_cliente
            ORDER BY
                Total_Compras DESC
        """

df_consulta_4 = consultar_bd(query, usuario_db, password_db, host_db, nombre_db)

df_consulta_4

             Cliente  Total_Compras
0       Gloria Gómez       22855.18
1      Sergio Prieto       21655.80
2       Ramón Ortega       21032.41
3     Manuel Navarro       20896.33
4         Óscar León       20579.50
...              ...            ...
1976     Juan García          94.98
1977    Teresa Calvo          52.94
1978   Antonio Marín          44.27
1979  Vicente Campos          38.70
1980    Sofía Suárez          11.68

[1981 rows x 2 columns]

### 3.5-LISTADO DE EMPLEADOS Y EL NÚMERO DE ÓRDENES GESTIONADAS.

* Mostrar el nombre del empleado, el puesto y la cantidad de órdenes que ha gestionado.
* Utilizar GROUP BY y COUNT.

In [36]:
query = """SELECT DISTINCT
                CONCAT(emp.nombre_empleado, ' ',emp.apellido_empleado) AS Empleado,
                emp.puesto AS Puesto,
                COUNT(ord.id_orden) AS Num_Pedidos
            FROM
                empleados emp
            JOIN
                ordenes ord
            ON
                emp.id_empleado = ord.id_empleado
            GROUP BY
                emp.id_empleado,
                emp.nombre_empleado,
                emp.apellido_empleado
            ORDER BY
                Num_Pedidos DESC            
        """

df_consulta_5 = consultar_bd(query, usuario_db, password_db, host_db, nombre_db)

df_consulta_5

               Empleado     Puesto  Num_Pedidos
0           Rubén Vidal    Gerente           75
1         Manuel Flores     Cajero           74
2           Manuel Moya  Reponedor           71
3             Irene Gil     Cajero           67
4    Cristina Rodríguez  Reponedor           65
..                  ...        ...          ...
195         Andrés Moya    Gerente           37
196         Raúl Torres    Gerente           35
197     Fernando Prieto  Reponedor           34
198        Nuria Suárez  Reponedor           34
199         Lorena Díaz     Cajero           33

[200 rows x 3 columns]

### 3.6-LISTADO DE ÓRDENES, FIILTRADAS POR FECHA Y TIENDA.

* Mostrar todas las órdenes que se realizaron en un rango de fechas determinado (ej.: del 1 de enero de 2025 al 31 de enero de 2025) y en una tienda específica.
* Incluir datos de la tienda y del cliente.

In [37]:
query = """SELECT
                ord.id_orden,
                ord.fecha_orden,
                tie.id_tienda,
                tie.nombre_tienda AS Tienda,
                cli.id_cliente,
                CONCAT(cli.nombre_cliente, ' ',cli.apellido_cliente) AS Cliente
        FROM
                tiendas tie
        JOIN
                empleados emp
        ON
                tie.id_tienda = emp.id_tienda
        JOIN
                ordenes ord
        ON
                emp.id_empleado = ord.id_empleado
        JOIN
                clientes cli
        ON
                ord.id_cliente = cli.id_cliente
        WHERE
                tie.id_tienda = 2
        AND
                ord.fecha_orden BETWEEN '2025-01-01' AND '2025-01-31'
        ORDER BY
                ord.fecha_orden DESC
        """

df_consulta_6 = consultar_bd(query, usuario_db, password_db, host_db, nombre_db)

df_consulta_6

,id_orden,fecha_orden,id_tienda,Tienda,id_cliente,Cliente
0,4226,2025-01-31,2,Supermercado 2,1329,Guillermo Guerrero
1,2433,2025-01-30,2,Supermercado 2,278,Roberto González
2,3581,2025-01-30,2,Supermercado 2,920,Irene Delgado
3,4191,2025-01-30,2,Supermercado 2,381,Alicia Pardo
4,7974,2025-01-30,2,Supermercado 2,1021,José Blanco
...,...,...,...,...,...,...
78,6807,2025-01-03,2,Supermercado 2,48,Beatriz Rodríguez
79,8282,2025-01-03,2,Supermercado 2,873,Carmen Prieto
80,7633,2025-01-02,2,Supermercado 2,274,Carlos Ruiz
81,8917,2025-01-02,2,Supermercado 2,1667,Laura Moreno
82,6491,2025-01-01,2,Supermercado 2,994,Rosa Fuentes

### 3.7-RANKING DE LOS PRODUCTOS MÁS VENDIDOS EN CADA TIENDA.

* Para cada tienda, mostrar los 3 productos más vendidos (en términos de cantidad total).
* Habrá que unir tiendas, empleados, ordenes y detalle_orden, además de productos.
* Usar GROUP BY y ordena por la cantidad sumada (y opcionalmente, un LIMIT 3).

In [39]:
query = """SELECT 
                tie1.id_tienda,
                tie1.nombre_tienda,
                pro1.id_producto,
                pro1.nombre_producto,
                ventas.total_vendido
            FROM 
                tiendas tie1
            JOIN (
                SELECT 
                    venta_total.id_tienda,
                    venta_total.id_producto,
                    venta_total.total_vendido
                FROM (
                    SELECT 
                        tie2.id_tienda,
                        det2.id_producto,
                        SUM(det2.cantidad) AS total_vendido
                    FROM 
                        tiendas tie2
                    JOIN 
                        empleados emp2 ON tie2.id_tienda = emp2.id_tienda
                    JOIN 
                        ordenes ord2 ON emp2.id_empleado = ord2.id_empleado
                    JOIN 
                        detalle_ordenes det2 ON ord2.id_orden = det2.id_orden
                    GROUP BY 
                        tie2.id_tienda, det2.id_producto
                ) venta_total
                WHERE 
                    (SELECT COUNT(*)
                    FROM (
                        SELECT 
                            tie3.id_tienda,
                            det3.id_producto,
                            SUM(det3.cantidad) AS total_vendido
                        FROM 
                            tiendas tie3
                        JOIN 
                            empleados emp3 ON tie3.id_tienda = emp3.id_tienda
                        JOIN 
                            ordenes ord3 ON emp3.id_empleado = ord3.id_empleado
                        JOIN 
                            detalle_ordenes det3 ON ord3.id_orden = det3.id_orden
                        WHERE 
                            tie3.id_tienda = venta_total.id_tienda
                        GROUP BY 
                            tie3.id_tienda, det3.id_producto
                    ) subtotal_ventas
                    WHERE subtotal_ventas.total_vendido > venta_total.total_vendido
                    ) < 3
            ) ventas ON tie1.id_tienda = ventas.id_tienda
            JOIN 
                productos pro1 ON ventas.id_producto = pro1.id_producto
            ORDER BY 
                tie1.id_tienda, ventas.total_vendido DESC;
        """

df_consulta_7 = consultar_bd(query, usuario_db, password_db, host_db, nombre_db)

df_consulta_7

,id_tienda,nombre_tienda,id_producto,nombre_producto,total_vendido
0,1,Supermercado 1,15,Producto_Verduras_3,1022.0
1,1,Supermercado 1,32,Producto_Pescadería_4,939.0
2,1,Supermercado 1,3,Producto_Lácteos_3,907.0
3,2,Supermercado 2,18,Producto_Bebidas_2,1053.0
4,2,Supermercado 2,8,Producto_Carnes_4,1025.0
5,2,Supermercado 2,20,Producto_Bebidas_4,983.0
6,3,Supermercado 3,19,Producto_Bebidas_3,907.0
7,3,Supermercado 3,39,Producto_Parafarmacia_3,905.0
8,3,Supermercado 3,23,Producto_Panadería_3,901.0
9,4,Supermercado 4,23,Producto_Panadería_3,1012.0
10,4,Supermercado 4,26,Producto_Higiene_2,981.0
11,4,Supermercado 4,1,Producto_Lácteos_1,972.0
12,5,Supermercado 5,22,Producto_Panadería_2,1068.0
13,5,Supermercado 5,34,Producto_Charcutería_2,979.0
14,5,Supermercado 5,28,Producto_Higiene_4,971.0
15,6,Supermercado 6,38,Producto_Parafarmacia_2,1038.0
16,6,Supermercado 6,14,Producto_Verduras_2,934.0
17,6,Supermercado 6,36,Producto_Charcutería_4,932.0
18,7,Supermercado 7,12,Producto_Frutas_4,1134.0
19,7,Supermercado 7,32,Producto_Pescadería_4,999.0
20,7,Supermercado 7,31,Producto_Pescadería_3,960.0
21,8,Supermercado 8,10,Producto_Frutas_2,991.0
22,8,Supermercado 8,5,Producto_Carnes_1,972.0
23,8,Supermercado 8,40,Producto_Parafarmacia_4,966.0
24,9,Supermercado 9,20,Producto_Bebidas_4,1004.0
25,9,Supermercado 9,16,Producto_Verduras_4,966.0
26,9,Supermercado 9,7,Producto_Carnes_3,922.0
27,10,Supermercado 10,3,Producto_Lácteos_3,969.0
28,10,Supermercado 10,29,Producto_Pescadería_1,962.0
29,10,Supermercado 10,7,Producto_Carnes_3,907.0